# File Handling
    open
    read
    write
    append
    close
    tell
    seek
    method1

In [1]:
f = open("sample.txt","r") #open the file
data = f.read() # reading the data
print(data) # printing the data
f.close() # close the file

good morning CRRCOE

#### Second Method

In [3]:
with open("sample.txt","r") as f:
    data=f.read()
print(data)

good morning CRRCOE

In [4]:
def readdata(filename):
    f=open(filename,"r")
    data=f.read()
    print(data)
    f.close()

filename = input()

sample.txt

In [5]:
readdata(filename)

good morning CRRCOE

#### Write

In [6]:
with open("text.txt","w") as f:
    f.write(input())

python class

In [7]:
n=int(input())
for i in range(n):
    with open("text.txt","w") as f:
        f.write(input())

2
hi
hello

#### Append

In [10]:
n=int(input())
for i in range(n):
    with open("text.txt","a") as f:
        f.write('\n'+input())

2
12
34

In [11]:
dir(f)

['_CHUNK_SIZE',
 '__class__',
 '__del__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__enter__',
 '__eq__',
 '__exit__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__lt__',
 '__ne__',
 '__new__',
 '__next__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '_checkClosed',
 '_checkReadable',
 '_checkSeekable',
 '_checkWritable',
 '_finalizing',
 'buffer',
 'close',
 'closed',
 'detach',
 'encoding',
 'errors',
 'fileno',
 'flush',
 'isatty',
 'line_buffering',
 'mode',
 'name',
 'newlines',
 'read',
 'readable',
 'readline',
 'readlines',
 'reconfigure',
 'seek',
 'seekable',
 'tell',
 'truncate',
 'writable',
 'write',
 'write_through',
 'writelines']

In [13]:
help(f.readlines)

Help on built-in function readlines:

readlines(hint=-1, /) method of _io.TextIOWrapper instance
    Return a list of lines from the stream.

    hint can be specified to control the number of lines read: no more
    lines will be read if the total size (in bytes/characters) of all
    lines so far exceeds hint.

In [14]:
with open("text.txt") as f:
    data=f.readlines()
    for i in data:
        print(i)

helloabci

j



12

34

In [15]:
data

['helloabci\n', 'j\n', '\n', '12\n', '34']

In [20]:
print(len("".join(data)))
"".join(data)

18

'helloabci\nj\n\n12\n34'

#### tell : it gives cursor position

In [21]:
with open("text.txt") as f:
    data=f.read()
    print(f.tell()) # it gives cursor position

22

In [23]:
with open("text.txt") as f:
    data=f.read()
    f.seek(2)# From seek location
    print(f.read(10))

lloabci
j

#### create a mobile number contacts  file

In [24]:
file='contacts_data.txt'
def newcontact(name,contact):
    fh = open(file,'a')
    fh.write(name+" "+str(contact)+"\n")
    fh.close()
    return 'contact saved'

In [27]:
a , b = input().split()
newcontact(a,b)

a 123

'contact saved'

### Read a contact

In [32]:
def readcontact(name):
    with open("contacts_data.txt",'r') as f:
        data_ = f.readlines()
        for string in data_:
            data_name, data_num = string.split()
            if name == data_name:
                return data_num
    
readcontact('b')

'324'

# Numpy
NumPy, short for Numerical Python, is one of the most important foundational packages for numerical computing in Python. 

NumPy operations perform complex computations on entire arrays without the need in Python for loops. 

NumPy arrays use much less memory than built-in Python sequences.

key features of NumPy is its N-dimensional array  object, or ndarray, which is a fast, flexible container for large datasets in Python.

In [33]:
# Import the numpy library
# np is simply an alias, you may use any other alias, though np is quite standard
import numpy as np

In [36]:
# Creating a 1-D array using a list
# np.array() takes in a list or a tuple as argument, and converts into an array
li = [2, 4, 5, 6, 7, 9]
array_1d = np.array(li)
print(array_1d)
print(type(array_1d))
print(li)
print(type(li))

[2 4 5 6 7 9]
<class 'numpy.ndarray'>
[2, 4, 5, 6, 7, 9]
<class 'list'>

In [37]:
# Creating a 2-D array using two lists
array_2d = np.array([[2, 3, 4], [5, 8, 7]])
print(array_2d)

[[2 3 4]
 [5 8 7]]

In NumPy, dimensions are called axes. In the 2-d array above, there are two axes, having two and three elements respectively.

In NumPy terminology, for 2-D arrays:

axis = 0 refers to the rows
axis = 1 refers to the columns
![not](https://raw.githubusercontent.com/GirishaDevara/ML/master/MLND/2.NumPy/Introduction%20to%20NumPy/numpy_axes.jpg)

## Advantages of NumPy

- it is convenience and speed.
- You can write vectorised code on numpy arrays, not on lists. which is convenient to read and write.
- Numpy is much faster than the standard python ways to do computations.

Let's see an example of convenience, we'll see one later for speed.

Say you have two lists of numbers, and want to calculate the element-wise product. The standard python list way would need you to map a lambda function (or worse - write a for loop), whereas with NumPy, you simply multiply the arrays.

In [38]:
list_1 = [3, 6, 7, 5]
list_2 = [4, 5, 1, 7]

# the list way to do it: map a function to the two lists
product_list = list(map(lambda x, y: x*y, list_1, list_2))
print(product_list)

[12, 30, 7, 35]

In [40]:
# The numpy array way to do it: simply multiply the two arrays
array_1 = np.array(list_1)
array_2 = np.array(list_2)

array_3 = array_1*array_2
print(array_3)
print(type(array_3))

[12 30  7 35]
<class 'numpy.ndarray'>

Even simple mathematical operations on lists require for loops, unlike with arrays. For example, to calculate the square of every number in a list:

In [41]:
# Square a list
list_squared = [i**2 for i in list_1]

# Square a numpy array
array_squared = array_1**2

print(list_squared)
print(array_squared)

[9, 36, 49, 25]
[ 9 36 49 25]

#### Creating NumPy Arrays

In [42]:
# Convert lists or tuples to arrays using np.array()
# Note that np.array(2, 5, 6, 7) will throw an error - you need to pass a list or a tuple
array_from_list = np.array([2, 5, 6, 7]) 
array_from_tuple = np.array((4, 5, 8, 9))

print(array_from_list)
print(array_from_tuple)

[2 5 6 7]
[4 5 8 9]

#### The other common way is to initialise arrays.
The following ways are commonly used:

- np.ones(): Create array of 1s
- np.zeros(): Create array of 0s
- np.random.random(): Create array of random numbers
- np.arange(): Create array with increments of a fixed step size
- np.linspace(): Create array of fixed length

In [44]:
np.arange(2,10)

array([2, 3, 4, 5, 6, 7, 8, 9])

In [45]:
# Tip: Use help to see the syntax when required
help(np.ones)

Help on function ones in module numpy:

ones(shape, dtype=None, order='C')
    Return a new array of given shape and type, filled with ones.

    Parameters
    ----------
    shape : int or sequence of ints
        Shape of the new array, e.g., ``(2, 3)`` or ``2``.
    dtype : data-type, optional
        The desired data-type for the array, e.g., `numpy.int8`.  Default is
        `numpy.float64`.
    order : {'C', 'F'}, optional, default: C
        Whether to store multi-dimensional data in row-major
        (C-style) or column-major (Fortran-style) order in
        memory.

    Returns
    -------
    out : ndarray
        Array of ones with the given shape, dtype, and order.

    See Also
    --------
    ones_like : Return an array of ones with shape and type of input.
    empty : Return a new uninitialized array.
    zeros : Return a new array setting values to zero.
    full : Return a new array of given shape filled with value.


    Examples
    --------
    >>> np.ones(5)
    array([ 1.,  1.,  1.,  1.,  1.])

    >>> np.ones((5,), dtype=int)
    array([1, 1, 1, 1, 1])

    >>> np.ones((2, 1))
    array([[ 1.],
           [ 1.]])

    >>> s = (2,2)
    >>> np.ones(s)
    array([[ 1.,  1.],
           [ 1.,  1.]])

In [46]:
# Creating a 5 x 3 array of ones
np.ones((5, 3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [47]:
# Notice that, by default, numpy creates data type = float64
# Can provide dtype explicitly using dtype
np.ones((5, 3), dtype = np.int)

array([[1, 1, 1],
       [1, 1, 1],
       [1, 1, 1],
       [1, 1, 1],
       [1, 1, 1]])

In [48]:
# Creating array of zeros
np.zeros(4, dtype = np.int)

array([0, 0, 0, 0])

In [49]:
# Array of random numbers
np.random.random([3, 4])

array([[0.76515839, 0.94115304, 0.37616526, 0.92785942],
       [0.36754655, 0.95673919, 0.21381187, 0.13979473],
       [0.04194874, 0.62261923, 0.26029069, 0.79421848]])

In [50]:
# Creating a 4 x 3 array of 7s using np.full()
# The default data type here is int only
np.full((4,3), 7)

array([[7, 7, 7],
       [7, 7, 7],
       [7, 7, 7],
       [7, 7, 7]])

In [51]:
# Initialising a random 1000 x 300 array
rand_array = np.random.random((1000, 300))

# Print the second row
print(rand_array[1,:])

[2.14706052e-02 7.50683064e-02 1.31516498e-02 5.45846352e-01
 1.22227405e-01 4.36720588e-01 1.92632526e-01 5.55230367e-01
 9.72202330e-01 8.42624776e-01 3.29920180e-01 5.23749698e-01
 4.06675172e-01 8.82615298e-01 7.18659951e-02 5.06565100e-01
 3.80983560e-01 7.85995712e-01 5.83054074e-02 1.09006162e-01
 3.13528708e-01 7.88092662e-01 8.13843682e-02 3.18712588e-01
 9.01657403e-01 3.30982526e-01 5.32579912e-01 7.20982157e-02
 5.24487482e-01 1.99124748e-01 6.57727919e-01 9.61842693e-01
 6.67712126e-01 4.49409837e-01 3.34728452e-01 7.64757772e-01
 4.78785156e-01 9.66504887e-01 4.25509681e-01 5.75666905e-01
 5.13937001e-01 5.65363595e-01 2.87265080e-01 6.69307140e-01
 7.52186773e-01 2.84373409e-01 5.94145812e-01 1.10360088e-01
 4.44896702e-01 2.28298324e-01 7.96457232e-01 7.24648257e-01
 8.61122703e-01 4.89597671e-01 3.25724586e-01 1.80377188e-01
 5.76720324e-01 3.03919175e-01 1.70469997e-01 7.05556930e-01
 6.51569781e-01 6.38887628e-01 2.71809721e-01 8.94692010e-01
 8.40894232e-01 8.24544806e-01 7.17335396e-01 9.44128565e-01
 6.90900837e-01 1.30893653e-02 8.43665157e-01 5.06156269e-01
 9.84783511e-01 8.60816738e-01 3.67492369e-01 6.98618831e-01
 4.71037366e-01 8.58573163e-01 5.17253234e-01 7.88020221e-02
 2.64802975e-01 1.72113886e-01 6.83616425e-01 9.05512346e-01
 4.31300105e-02 1.15148116e-01 6.83609097e-01 7.47891741e-01
 7.90225878e-01 9.68620344e-01 8.81885761e-01 8.71034936e-01
 6.24257140e-01 3.12101759e-01 7.12297177e-01 2.57630311e-01
 2.43923094e-01 9.81758183e-01 8.70102443e-01 7.92200503e-01
 6.57431788e-01 6.58063147e-01 6.10273391e-01 9.03643627e-01
 5.93085811e-02 5.95740393e-01 9.04455272e-01 8.33402680e-01
 8.51390957e-01 7.91739094e-01 7.37720954e-01 6.14963916e-01
 5.51418700e-01 4.40508868e-02 6.12845271e-02 2.05316051e-01
 4.23380662e-01 1.16289025e-01 5.08016108e-01 9.89060556e-01
 5.96467524e-01 1.85910642e-01 5.40991225e-02 6.34025445e-01
 6.19203834e-01 1.95704146e-01 3.92668943e-01 2.65719794e-01
 4.31001719e-01 3.66428579e-01 9.65178524e-01 4.84311788e-01
 1.50846517e-01 6.75347765e-01 6.97808730e-01 7.51975554e-01
 1.98718965e-01 5.10583237e-01 6.77839499e-01 5.28397748e-01
 5.16528745e-01 2.86411989e-02 5.40116788e-01 6.83245354e-02
 8.43148850e-03 9.93222515e-01 2.32256520e-01 7.87170067e-01
 6.19542705e-01 8.09212535e-01 4.94495964e-01 7.64906305e-01
 7.91943882e-01 9.36643028e-01 5.74115923e-01 9.15114471e-01
 4.62841527e-01 8.78682490e-01 7.26157925e-01 4.49804024e-01
 6.64011222e-01 1.95641036e-01 9.49923544e-01 3.49713400e-01
 8.17243571e-01 1.25135540e-01 7.90611712e-01 7.01721253e-01
 6.97268648e-02 5.13927212e-01 5.63612135e-01 8.72754797e-01
 1.09219758e-02 9.84118872e-01 2.71897155e-01 5.67750374e-01
 8.56757842e-01 6.86978861e-01 7.07856205e-01 4.73670121e-01
 4.29775966e-01 1.41261515e-01 6.99925609e-02 9.29812512e-01
 3.41534218e-01 8.18265968e-01 7.28877396e-01 7.38329482e-01
 1.39054299e-01 1.71208317e-02 4.20829868e-01 4.43571368e-01
 4.11188931e-01 4.15441510e-01 1.88445302e-01 9.33331330e-02
 8.51244878e-01 8.30857676e-01 9.82461017e-01 7.46609052e-01
 3.03990269e-01 4.37722912e-01 2.07485302e-01 3.01290056e-02
 1.60422863e-01 8.25853607e-01 2.91579122e-01 7.40858210e-02
 3.08873478e-01 9.28331354e-01 2.33346856e-01 6.12134222e-01
 4.43360409e-01 9.76947364e-02 3.56562143e-01 5.10394279e-01
 6.65250698e-01 7.03029405e-01 6.08521393e-02 8.70634987e-01
 9.38636749e-01 3.11636770e-01 2.71222019e-01 7.78730793e-01
 7.66481806e-01 2.19627293e-01 9.94207698e-01 4.59623722e-01
 3.34188649e-01 2.76796689e-01 3.54709465e-02 3.77078246e-01
 3.94497023e-01 8.30515500e-02 4.62496135e-01 3.83799591e-01
 7.06876641e-01 2.39170957e-02 7.00371293e-01 4.51286177e-01
 7.89085803e-01 5.40850388e-01 4.47282930e-01 9.51879361e-01
 6.33582586e-01 8.74109538e-01 6.25756349e-01 3.35636890e-02
 6.45594747e-01 4.71020880e-01 3.11049280e-01 7.89116741e-01
 6.81710018e-01 6.73802339e-01 8.16678504e-01 8.90417598e-01
 9.76946240e-01 5.72530321e-02 3.55498556e-01 3.36085103e-01
 3.25948418e-01 9.99784022e-01 2.43271671e-02 6.15377834e-01
 6.94174206e-01 3.30604066e-01 3.71009849e-01 7.98457274e-01
 1.89987789e-01 3.47347076e-01 2.65767546e-01 2.79922400e-01
 5.59112563e-01 8.86538418e-03 5.22179769e-01 2.94746996e-02
 1.29276663e-01 9.61297992e-01 9.33894806e-01 3.05329560e-02
 6.31188640e-04 7.87587743e-02 3.05237755e-01 6.63821068e-01
 8.07424981e-01 7.49686857e-01 6.60905935e-01 7.19249932e-02
 2.95263095e-01 6.61025203e-02 9.83443798e-01 8.49796749e-01
 3.34768953e-01 6.80570727e-01 1.40948164e-01 3.85810590e-02
 9.16853816e-02 2.63535792e-01 2.09915797e-01 2.91871668e-01]

In [52]:
# Inspecting shape, dtype, ndim and itemsize
print("Shape: {}".format(rand_array.shape))
print("dtype: {}".format(rand_array.dtype))
print("Dimensions: {}".format(rand_array.ndim))
print("Item size: {}".format(rand_array.itemsize))

Shape: (1000, 300)
dtype: float64
Dimensions: 2
Item size: 8

Reading 3-D arrays is not very obvious, because we can only print maximum two dimensions on paper, and thus they are printed according to a specific convention. Printing higher dimensional arrays follows the following conventions:

- The last axis is printed from left to right
- The second-to-last axis is printed from top to bottom
- The other axes are also printed top-to-bottom, with each slice separated by another using an empty line

Let's see some examples.

In [53]:
# Creating a 3-D array
# reshape() simply reshapes a 1-D array 
array_3d = np.arange(24)
print(array_3d)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23]

In [54]:
array_3d.reshape(2, 3, 4)

array([[[ 0,  1,  2,  3],
        [ 4,  5,  6,  7],
        [ 8,  9, 10, 11]],

       [[12, 13, 14, 15],
        [16, 17, 18, 19],
        [20, 21, 22, 23]]])

- The last axis has 4 elements, and is printed from left to right.
- The second last has 3, and is printed top to bottom
- The other axis has 2, and is printed in the two separated blocks

#### Subset, Slice, Index and Iterate through Arrays
For one-dimensional arrays, indexing, slicing etc. is similar to python lists - indexing starts at 0.

In [55]:
# Indexing and slicing one dimensional arrays
array_1d = np.arange(10)
print(array_1d)

[0 1 2 3 4 5 6 7 8 9]

In [56]:
# Third element
print(array_1d[2])

# Specific elements
# Notice that array[2, 5, 6] will throw an error, you need to provide the indices as a list
print(array_1d[[2, 5, 6]])

# Slice third element onwards
print(array_1d[2:])

# Slice first three elements
print(array_1d[:3])

# Slice third to seventh elements
print(array_1d[2:7])

# Subset starting 0 at increment of 2 
print(array_1d[0::2])

2
[2 5 6]
[2 3 4 5 6 7 8 9]
[0 1 2]
[2 3 4 5 6]
[0 2 4 6 8]

#  Pandas
Pandas is a library built using NumPy specifically for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc.

There are two main data structures in Pandas - Series and Dataframes. The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis.

1. The pandas Series (similar to a numpy array)
    - Creating a pandas series
    - Indexing series
2. Dataframes
    - Creating dataframes from dictionaries
    - Importing CSV data files as pandas dataframes
    - Reading and summarising dataframes
    - Sorting dataframes


## 1. The Pandas Series
A series is similar to a 1-D numpy array, and contains scalar values of the same type (numeric, character, datetime etc.). A dataframe is simply a table where each column is a pandas series.

In [57]:
# import pandas, pd is an alias
import pandas as pd
import numpy as np

# Creating a numeric pandas series
s = pd.Series([2, 4, 5, 6, 9])
print(s)
print(type(s))

0    2
1    4
2    5
3    6
4    9
dtype: int64
<class 'pandas.core.series.Series'>

In [58]:
# creating a series of characters
# notice that the 'dtype' here is 'object'
char_series = pd.Series(['a', 'b', 'af'])
char_series

0     a
1     b
2    af
dtype: object

In [59]:
# creating a series of type datetime
date_series = pd.date_range(start = '11-09-2017', end = '12-12-2017')
date_series

DatetimeIndex(['2017-11-09', '2017-11-10', '2017-11-11', '2017-11-12',
               '2017-11-13', '2017-11-14', '2017-11-15', '2017-11-16',
               '2017-11-17', '2017-11-18', '2017-11-19', '2017-11-20',
               '2017-11-21', '2017-11-22', '2017-11-23', '2017-11-24',
               '2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
               '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
               '2017-12-03', '2017-12-04', '2017-12-05', '2017-12-06',
               '2017-12-07', '2017-12-08', '2017-12-09', '2017-12-10',
               '2017-12-11', '2017-12-12'],
              dtype='datetime64[ns]', freq='D')

## Indexing Series
Indexing series is exactly same as 1-D numpy arrays - index starts at 0.

In [60]:
# Indexing pandas series: Same as indexing 1-d numpy arrays or lists
# accessing the fourth element
s[3]

6

In [62]:
# accessing elements starting index = 2 till the end
s[2:]

2    5
3    6
4    9
dtype: int64

In [61]:
# accessing the second and the fourth elements
# note that s[1, 3] will not work, you need to pass the indices [1, 3] as a list inside the original []
s[[1, 3]]

1    4
3    6
dtype: int64

### The Pandas Dataframe
Dataframe is the most widely used data-structure in data analysis. It is a table with rows and columns, with rows having an index and columns having meaningful names.
#### Creating dataframes from dictionaries
There are various ways of creating dataframes, such as creating them from dictionaries, JSON objects, reading from txt, CSV files, etc.

In [63]:
# keys become column names
df = pd.DataFrame({'name': ['Vinay', 'Kushal', 'Aman', 'Saif'], 
                   'age': [22, 25, 24, 28], 
                    'occupation': ['engineer', 'doctor', 'data analyst', 
                                   'teacher']})
df

     name  age    occupation
0   Vinay   22      engineer
1  Kushal   25        doctor
2    Aman   24  data analyst
3    Saif   28       teacher

### Importing CSV data files as pandas dataframes

In [64]:
# reading a CSV file as a dataframe
titanic_df = pd.read_csv("titanic.csv")

In [65]:
titanic_df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
870,871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### Reading and Summarising Dataframes
After you import a dataframe, you'd want to quickly understand its structure, shape, meanings of rows and columns etc. Further, you may want to look at summary statistics - such as mean, percentiles etc.

In [66]:
# Looking at the top and bottom entries of dataframes
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [68]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [70]:
# Looking at the datatypes of each column
titanic_df.info()

# Note that each column is basically a pandas Series of length 8399
# The ID columns are 'objects', i.e. they are being read as characters
# The rest are numeric (floats or int)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Gender         891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [71]:
# Describe gives you a summary of all the numeric columns in the dataset
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [73]:
# The number of rows and columns
titanic_df.shape

(891, 12)

###  Problem 
Given a series of integer pairs A and B, output the sum of A and B. 

- Input Format:

Each line contains two integers, A and B. One input file may contain several pairs P.

- Output Format:

Output a single integer per line - The sum of A and B.

| Sample Input   |      Sample Output      |
|----------|:-------------:|
| 1  2 |  3 |
| 2  5 |   7   |
| 10  14 | 24 |

In [74]:
while True:
    a,b = map(int,input().split())
    print(a+b)
    if a == " ":
        break

1 2
3
2 3
5

ValueError: not enough values to unpack (expected 2, got 0)

# Exception Handling
 
 Exception Errors :

- ZeroDivisionError
- IOError : if file can’t be opened
- KeyboardInterrupt : when an unrequired key is pressed by the user
- ValueError : when built-in function receives a wrong argument
- EOFError : if End-Of-File is hit without reading any data
- ImportError : if it is unable to find the module


try:

The code with the exception that you want to catch. If an exception is raised, control flow leaves this block immediately and goes to the except block

except [(Exception[, Exception])] [as VAR]:

In [71]:
10/0

ZeroDivisionError: division by zero

In [74]:
def divide(x,y):
    return x//y
x = int(input())
y = int(input())
divide(x,y)

21
0

ZeroDivisionError: integer division or modulo by zero

In [75]:
def divide(x,y):
    try:
        return x//y
    except ZeroDivisionError:
        return "your dividing by 0 "
    
x = int(input())
y = int(input())
divide(x,y)

21
0

'hey you are dividing by 0 '

[Problem 2](https://www.hackerearth.com/practice/basic-programming/bit-manipulation/basics-of-bit-manipulation/practice-problems/algorithm/mystery-30/)

In [79]:
def foo10():
    try:
        1 + '0'
    except:
        print('caught exception')
    else:  #  runs only when there is no excption 
        print('no exception raised')
    finally:
        print('finally')

In [80]:
foo10()

caught exception
finally